app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "token", "updated_at", "username", "secret") VALUES('2009-06-05 18:02:51', '2J6ZoMazwhnrJpWVDkLQQA', '2009-06-05 18:02:51', 'khall', '5lturD3Vp5W9xjEfDcTXVP8DrCkBoaVznmL70Ko')
---
  def callback
    @request_token = OAuth::RequestToken.new(UsersController.consumer, session[:request_token], session[:request_token_secret])
    @access_token = @request_token.get_access_token
    @response = UsersController.consumer.request(:get, '/oauth/verify_credentials', @access_token, {:scheme => :query_string})

    case @response
    when Net::HTTPSuccess
      user_info = JSON.parse(@response.body)
      unless user_info['username']
        flash[:notice] = 'authentication failed'
        redirect_to :action => :index
        return
      end

      @user = User.new(:username => user_info['username'], :token => @access_token.token, :secret => @access_token.secret)
      @user.save!

SELECT * FROM "users" WHERE ("users"."username" = 'khall') LIMIT 1
---
  def create_project
    @user = User.find_by_username(session['user'])